## Staging: performance-test
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 4 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.notify_performance_test_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "notify_performance_test_s3"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.notify_performance_test_s3 will be created
  + resource "aws_iam_policy" "notify_performance_test_s3" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "NotifyPerformanceTestS3Access"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.s3_notify_performance_test will be created
  + resource "aws_iam_role_policy_attachment" "s3_notify_performance_test" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "performance-test-iam-role"
    }

  # aws_lambda_function.performance-test will be updated in-place
  ~ resource "aws_lambda_function" "performance-test" {
        id                             = "performance-test"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:performance-test:1" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (16 unchanged attributes hidden)

      + environment {
          + variables = {
              + "LOAD_TEST_AWS_S3_BUCKET"                     = "notify-performance-test-results-staging"
              + "LOAD_TEST_BULK_EMAIL_TEMPLATE_ID"            = "5ebee3b7-63c0-4052-a8cb-387b818df627"
              + "LOAD_TEST_CSV_DIRECTORY_PATH"                = "/tmp/notify_performance_test"
              + "LOAD_TEST_DOMAIN"                            = "https://api.staging.notification.cdssandbox.xyz"
              + "LOAD_TEST_EMAIL"                             = "success@simulator.amazonses.com"
              + "LOAD_TEST_EMAIL_TEMPLATE_ID"                 = "a59b313d-8de2-4973-ac2f-66de7ec0b239"
              + "LOAD_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID" = "a59b313d-8de2-4973-ac2f-66de7ec0b239"
              + "LOAD_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"       = "5ebee3b7-63c0-4052-a8cb-387b818df627"
              + "LOAD_TEST_PHONE_NUMBER"                      = "16132532222"
              + "LOAD_TEST_SMS_TEMPLATE_ID"                   = "83d01f06-a818-4134-bd69-ce90a2949280"
              + "TEST_AUTH_HEADER"                            = "apikey-v1 c55039fc-c0e1-44db-a14e-b6a669148ec6"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.notify_performance_test_results.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "notify-performance-test-results-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.notify_performance_test_results.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 4 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>